In [1]:
#import the sqlalchemy library to create the engine aka tunnel in order to connect python with the local database 
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

In [2]:
#create variables with the db's credentials 
HOST = 'localhost'
PORT = '5433'
USERNAME = 'postgres'
PASSWORD = '' 
DB = 'northwind'

In [3]:
#create the so called connection string with the defined parameters of the local db

conn_string = f'postgresql+psycopg2://{HOST}:{PORT}/{DB}'
conn_string

'postgresql+psycopg2://localhost:5433/northwind'

In [4]:
engine = create_engine(conn_string)

In [5]:
# ttest the connection to the local db with a query to create a new table

query = """
CREATE TABLE neworders2 (
col_1 VARCHAR(50),
col_2 INTEGER,
col_3 REAL
);
"""

In [6]:
# execution of the above defined engine with a test query

engine.execute(query)

In [46]:
df = pd.read_csv('/Users/sebastian/Documents/spiced_projects/euclidean_eukalyptus/encounter_notes/euclidean-eukalyptus-encounter-notes/01_week/large_countries_2015.csv')

In [8]:
df.head(
    
)

   Unnamed: 0    population  fertility      continent
0  Bangladesh  1.609956e+08       2.12           Asia
1      Brazil  2.078475e+08       1.78  South America
2       China  1.376049e+09       1.57           Asia
3       India  1.311051e+09       2.43           Asia
4   Indonesia  2.575638e+08       2.28           Asia

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  12 non-null     object
 1   population  12 non-null     float64
 2   fertility   12 non-null     float64
 3   continent   12 non-null     object
dtypes: float64(2), object(2)
memory usage: 512.0+ bytes

In [52]:
# edit entries of the dataframe 

df.loc[df['continent']=='South America',"continent"]="Latin America"

In [53]:
df

          country    population  fertility      continent
0      Bangladesh  1.609956e+08       2.12           Asia
1          Brazil  2.078475e+08       1.78  Latin America
2           China  1.376049e+09       1.57           Asia
3           India  1.311051e+09       2.43           Asia
4       Indonesia  2.575638e+08       2.28           Asia
5           Japan  1.265735e+08       1.45           Asia
6          Mexico  1.270172e+08       2.13  North America
7         Nigeria  1.822020e+08       5.89         Africa
8        Pakistan  1.889249e+08       3.04           Asia
9     Philippines  1.006994e+08       2.98           Asia
10         Russia  1.434569e+08       1.61         Europe
11  United States  3.217736e+08       1.97  North America

In [54]:
# creating a new table with the datatypes and - structure of the df

df.to_sql('orders4', engine)

In [49]:
# edit missing column name 
df.rename({'Unnamed: 0':'country'}, axis= 1, inplace=True)

In [55]:
list(df)

['country', 'population', 'fertility', 'continent']

In [62]:
# retrieve directly information about a table from the db

query_column_type = """select column_name, data_type from information_schema.columns where table_name = 'orders4';"""

list(engine.execute(query_column_type))

[]

In [61]:
#drop table from db

query_drop_table = """DROP TABLE orders4;"""

#engine.execute(query_drop_table)

In [65]:
#creat a new dataframe from a certain table of the db

query5="SELECT * FROM order_details"
order_details = pd.read_sql(query5, engine)
order_details.head(100)

   orderid productid  unitprice  quantity  discount
0    10248        11       14.0      12.0      0.00
1    10248        42        9.8      10.0      0.00
2    10248        72       34.8       5.0      0.00
3    10249        14       18.6       9.0      0.00
4    10249        51       42.4      40.0      0.00
..     ...       ...        ...       ...       ...
95   10284        27       35.1      15.0      0.25
96   10284        44       15.5      21.0      0.00
97   10284        60       27.2      20.0      0.25
98   10284        67       11.2       5.0      0.25
99   10285         1       14.4      45.0      0.20

[100 rows x 5 columns]

In [68]:
order_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   orderid    2155 non-null   object
 1   productid  2155 non-null   object
 2   unitprice  2155 non-null   float64
 3   quantity   2155 non-null   float64
 4   discount   2155 non-null   float64
dtypes: float64(3), object(2)
memory usage: 84.3+ KB

In [71]:
sum_of_sales = order_details[['unitprice','quantity']].sum()

In [75]:
def sales (unitprice, quantity):
    sum = unitprice*quantity
    print(sum)
    return sum

In [83]:
#sales(order_details[['unitprice','quantity']]) = sum

SyntaxError: cannot assign to function call (<ipython-input-83-005c7b8d0a3b>, line 1)